app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["created_at", "2018-04-11 15:08:08.868416"], ["updated_at", "2018-04-11 15:08:08.868416"]]
---
	def update
		@student = Student.find(params[:id])
		@student = Student.create({first_name: params[:student][:first_name], last_name: params[:student][:last_name]})