app/controllers/students_controller.rb

  def update
    student = Student.find(params[:id])
    student.update(student_params(:first_name, :last_name))
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 6]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Ayy!"], ["last_name", "Lmao!"], ["updated_at", "2018-04-11 13:45:16.196861"], ["id", 6]]